In [1]:
import pandas as pd

In [8]:
# Pandas Series
my_series = pd.Series([10,30,-6,9])

In [9]:
my_series

0    10
1    30
2    -6
3     9
dtype: int64

In [12]:
print(my_series.index) # returns index
print(my_series.values) # returns values

RangeIndex(start=0, stop=4, step=1)
[10 30 -6  9]

In [15]:
my_series2 = pd.Series([10,30,6,9],index=['Bill','Denise','John','Cassandra'])
my_series2

Bill         10
Denise       30
John          6
Cassandra     9
dtype: int64

In [18]:
print(my_series2[1])
print(my_series2['Denise'])

30
30

In [20]:
population_dict = {
    'California' : 38000,
    'Texas' : 26400,
    'New York': 196000,
    'Florida' : 19000
}

In [24]:
population = pd.Series(population_dict)
print(population)

California     38000
Texas          26400
New York      196000
Florida        19000
dtype: int64

In [28]:
population.mean()

69850.0

In [29]:
import numpy as np
np.mean(population) # numpy can take a pandas object!!

69850.0

In [31]:
#mean(population) # this would run in R, not in Python

In [32]:
# create a dict of lists
my_dict = {
    'name':['Bella','Charlie','Lucy'],
    'breed':['Labrador','Poodle','ChowChow'],
    'color':['Brown','Black','Brown'],
    'weight':[24,24,17]
}

In [33]:
my_dict

{'name': ['Bella', 'Charlie', 'Lucy'],
 'breed': ['Labrador', 'Poodle', 'ChowChow'],
 'color': ['Brown', 'Black', 'Brown'],
 'weight': [24, 24, 17]}

In [34]:
df = pd.DataFrame(my_dict)
print(df)

      name     breed  color  weight
0    Bella  Labrador  Brown      24
1  Charlie    Poodle  Black      24
2     Lucy  ChowChow  Brown      17

In [35]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [36]:
df.columns

Index(['name', 'breed', 'color', 'weight'], dtype='object')

In [37]:
df.values

array([['Bella', 'Labrador', 'Brown', 24],
       ['Charlie', 'Poodle', 'Black', 24],
       ['Lucy', 'ChowChow', 'Brown', 17]], dtype=object)

In [13]:
import pandas as pd
# pd.set_option('display.max_rows', 10) default is 10, you can change it to n > number of rows

# read_csv() function to read in csv files in pandas
#df = pd.read_csv(r'C:\Users\bilene\Downloads\gapminder.csv')
df = pd.read_csv(r'https://raw.githubusercontent.com/ernbilen/Data200_Fall22/main/data/gapminder.csv')

#airmen = pd.read_csv(r'https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2022/2022-02-08/airmen.csv')
#airmen

df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [14]:
df.shape

(1704, 6)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [16]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [94]:
dogs = pd.read_csv(r'https://raw.githubusercontent.com/ernbilen/Data200_Fall22/main/data/dogs.csv')
dogs

      name       breed  color  height_cm  weight_kg date_of_birth
0    Bella    Labrador  Brown         56         24    2013-07-01
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
4      Max    Labrador  Black         59         29    2017-01-28
5   Stella   Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St.Bernard  White         77         74    2018-02-27

In [20]:
#dogs.name # access by name

In [21]:
#dogs['name'] # access by name (most flexible)

In [28]:
#dogs.loc[:,'name'] # access by name (similar to list syntax)

In [27]:
#dogs.iloc[:,0] # access by index (similar to list syntax)

In [29]:
#dogs[['height_cm','breed']] # get columns height_cm, breed

In [35]:
#dogs.iloc[0:2,] # get first two rows, using iloc

In [36]:
#dogs[:2] # get first two rows, using index approach

In [43]:
#dogs[dogs.height_cm > 50] # get rows where height_cm>50

In [44]:
#dogs.loc[dogs.height_cm>50] # get rows where height_cm>50

In [58]:
#dogs[dogs.breed=='Labrador'] get rows where breed is Labrador
#dogs[dogs['breed'] == 'Labrador']

In [57]:
#dogs[dogs.date_of_birth > "2015-01-01"] # birthday > Jan 1, 2015

In [59]:
dogs

      name       breed  color  height_cm  weight_kg date_of_birth
0    Bella    Labrador  Brown         56         24    2013-07-01
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
4      Max    Labrador  Black         59         29    2017-01-28
5   Stella   Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St.Bernard  White         77         74    2018-02-27

In [69]:
#dogs[(dogs['breed'] == 'Labrador') & (dogs.date_of_birth > "2015-01-01")] # two conditions at the same time, breed == Labrador and birthday > Jan 1, 2015
                                                # can't use 'and'
                                                # have to use parantheses around each condition

In [70]:
#dogs[dogs.color.isin(['Black','Brown'])] # .isin() function to subset based on multiple categories in a list

In [73]:
#dogs.loc[1:3,'breed']  # get row index 1,2,3 and column breed
#dogs.breed.iloc[1:4]

1       Poodle
2     ChowChow
3    Schnauzer
Name: breed, dtype: object

In [86]:
#dogs.iloc[1:4]['breed']

In [87]:
#dogs.iloc[1:4]['breed'] # .breed works too!

In [97]:
dogs['height_m'] = dogs.height_cm/100  # convert height (in cm) to height in meters. Create a new column called height_m.

In [98]:
dogs

      name       breed  color  height_cm  weight_kg date_of_birth  height_m
0    Bella    Labrador  Brown         56         24    2013-07-01      0.56
1  Charlie      Poodle  Black         43         24    2016-09-16      0.43
2     Lucy    ChowChow  Brown         46         24    2014-08-25      0.46
3  Coooper   Schnauzer   Gray         49         17    2011-12-11      0.49
4      Max    Labrador  Black         59         29    2017-01-28      0.59
5   Stella   Chihuahua    Tan         18          2    2015-04-20      0.18
6   Bernie  St.Bernard  White         77         74    2018-02-27      0.77

In [101]:
dogs['bmi'] = dogs.weight_kg / dogs.height_m**2 # create bmi = weight / height^2 * note the double stars for power
dogs

,name,breed,color,height_cm,weight_kg,date_of_birth,height_m,bmi
0,Bella,Labrador,Brown,56,24,2013-07-01,0.56,76.530612
1,Charlie,Poodle,Black,43,24,2016-09-16,0.43,129.799892
2,Lucy,ChowChow,Brown,46,24,2014-08-25,0.46,113.421550
3,Coooper,Schnauzer,Gray,49,17,2011-12-11,0.49,70.803832
4,Max,Labrador,Black,59,29,2017-01-28,0.59,83.309394
5,Stella,Chihuahua,Tan,18,2,2015-04-20,0.18,61.728395
6,Bernie,St.Bernard,White,77,74,2018-02-27,0.77,124.810255